[
  {
    "episode_number": 1,
    "drug": "minoxidil",
    "disease": "alopecia",
    "title": "Minoxidil - The Hairy Discovery",
    "description": "In the late 1950s, Upjohn chemists were hunting for an ulcer cure when they accidentally stumbled upon a blood pressure drug that caused one embarrassing side effect: patients sprouted hair everywhere, like werewolves on medication. Deemed a cosmetic nightmare that caused women to stop their lifesaving hypertension treatment, this \"flaw\" nearly ended the drug's commercial viability—until a cardiologist's casual consultation with a Miami dermatologist transformed it into the world's first FDA-approved hair loss treatment. What followed was a 15-year patent war, a $200 million blockbuster, and a cultural revolution that legitimized an entire industry of appearance medicine—all because someone paid attention when patients started getting hairy.",
    "pub_date": "December 5, 2025",
    "duration_seconds": 4200,
    "mp3_filename": "minoxidil-alopecia.mp3",
    "source_mp3": "minoxidil full-episode.mp3"
  },
  {
    "episode_number": 2,
    "drug": "rituximab",
    "disease": "ms",
    "title": "The Cancer Drug That Rewrote MS",
    "description": "In 1997, the FDA approved rituximab to kill cancerous B cells in lymphoma patients—it would become one of the best-selling drugs in history, generating over $100 billion in revenue. But within a decade, this cancer drug would accidentally overturn 50 years of scientific consensus about multiple sclerosis, revealing that neurologists had been targeting the wrong immune cells all along. The result: a paradigm shift that transformed MS from a disease of inevitable disability into a manageable condition, giving hundreds of thousands of patients something they'd never had before—hope for a life without relapses. This is the story of how a single 2008 trial showing 91% reduction in MRI lesions stunned the neurology world, spawned a $9 billion annual market, and became the first treatment ever for primary progressive MS.",
    "pub_date": "December 5, 2025",
    "duration_seconds": 2707,
    "mp3_filename": "rituximab-ms.mp3",
    "source_mp3": "full-episode.mp3"
  },
  {
    "episode_number": 3,
    "drug": "sirolimus",
    "disease": "multiple",
    "title": "Sirolimus - The Molecule That Refused to Die",
    "description": "Sirolimus—discovered accidentally on Easter Island in 1972—nearly died as a drug before being resurrected as a transplant immunosuppressant. But its true story began when researchers realized the same molecular mechanism (mTOR dysregulation) explained diseases that seemed unrelated: brain tumors in children with tuberous sclerosis, progressive lung disease in women, vascular malformations in infants, and rare inflammatory syndromes. This is the story of one molecule's remarkable 50-year journey across disease domains, told through the dedication of researchers like Suren Sehgal who refused to let the molecule die, the power of patients becoming scientists like David Fajgenbaum who decoded his own disease, and the profound impact of understanding biology at the molecular level. From four FDA approvals in TSC to first-ever disease-modifying therapy for LAM to emerging applications in aging and autoimmunity, this episode explores how one pathway can unlock treatment for millions.",
    "pub_date": "December 9, 2025",
    "duration_seconds": 3016,
    "mp3_filename": "sirolimus-multiple.mp3",
    "source_mp3": "full-episode.mp3"
  }
]
